Revit 2027 API
UnitTypeId.UsGallons Property
 US gallons.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId UsGallons { get; }
Public Shared ReadOnly Property UsGallons As ForgeTypeId
	Get
public:
static property ForgeTypeId^ UsGallons {
	ForgeTypeId^ get ();
}
static member UsGallons : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
UnitTypeId Class
Autodesk.Revit.DB Namespace